# Imports

In [1]:
import pandas as pd
import numpy as np

In [2]:
labels = ['a', 'b', 'c']

minha_lista = [10, 20, 30]

arr = np.array([10, 20, 30])

d = {'a': 10, 'b': 20, 'c': 30}

In [3]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

In [4]:
pd.Series(data=labels, index=minha_lista)

10    a
20    b
30    c
dtype: object

In [5]:
pd.Series(labels, minha_lista)

10    a
20    b
30    c
dtype: object

In [6]:
d

{'a': 10, 'b': 20, 'c': 30}

In [7]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [8]:
ser1 = pd.Series([1, 2, 3, 4], ['USA', 'Germany', 'USSR', 'Japan'])

In [9]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [10]:
ser2 = pd.Series([1, 2, 5, 4], ['USA', 'Germany', 'Italy', 'Japan'])

In [11]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [12]:
ser1['USA']

1

In [13]:
ser1['Germany']

2

In [14]:
ser1[['Germany', 'Japan']]

Germany    2
Japan      4
dtype: int64

In [15]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

## Data Frames

In [16]:
from numpy.random import randn

In [17]:
df = pd.DataFrame(randn(5, 4), ['A', 'B', 'C', 'D', 'E'], ['W', 'X', 'Y', 'Z'])

In [18]:
df

          W         X         Y         Z
A -0.385944 -0.495023  0.317290  0.141632
B -1.516287 -2.292915  0.711454  0.119752
C  0.597146  0.088397 -1.622199 -2.385858
D -0.143639 -0.810150 -2.557446  0.858009
E -0.418809  0.349715  1.188413 -1.030944

In [19]:
type(df)

pandas.core.frame.DataFrame

In [20]:
df['W'] # Padrão série

A   -0.385944
B   -1.516287
C    0.597146
D   -0.143639
E   -0.418809
Name: W, dtype: float64

In [21]:
df[['W']]  #Padrão data frame

          W
A -0.385944
B -1.516287
C  0.597146
D -0.143639
E -0.418809

In [22]:
df['new'] = df['W'] + df['Y']

In [23]:
df

          W         X         Y         Z       new
A -0.385944 -0.495023  0.317290  0.141632 -0.068654
B -1.516287 -2.292915  0.711454  0.119752 -0.804833
C  0.597146  0.088397 -1.622199 -2.385858 -1.025053
D -0.143639 -0.810150 -2.557446  0.858009 -2.701085
E -0.418809  0.349715  1.188413 -1.030944  0.769604

In [24]:
df.drop('new', axis =1)

          W         X         Y         Z
A -0.385944 -0.495023  0.317290  0.141632
B -1.516287 -2.292915  0.711454  0.119752
C  0.597146  0.088397 -1.622199 -2.385858
D -0.143639 -0.810150 -2.557446  0.858009
E -0.418809  0.349715  1.188413 -1.030944

In [25]:
df

          W         X         Y         Z       new
A -0.385944 -0.495023  0.317290  0.141632 -0.068654
B -1.516287 -2.292915  0.711454  0.119752 -0.804833
C  0.597146  0.088397 -1.622199 -2.385858 -1.025053
D -0.143639 -0.810150 -2.557446  0.858009 -2.701085
E -0.418809  0.349715  1.188413 -1.030944  0.769604

In [26]:
df2 = df.drop('new', axis=1)

In [27]:
df2

          W         X         Y         Z
A -0.385944 -0.495023  0.317290  0.141632
B -1.516287 -2.292915  0.711454  0.119752
C  0.597146  0.088397 -1.622199 -2.385858
D -0.143639 -0.810150 -2.557446  0.858009
E -0.418809  0.349715  1.188413 -1.030944

In [28]:
df.drop('new', axis=1, inplace=True)

In [29]:
df

          W         X         Y         Z
A -0.385944 -0.495023  0.317290  0.141632
B -1.516287 -2.292915  0.711454  0.119752
C  0.597146  0.088397 -1.622199 -2.385858
D -0.143639 -0.810150 -2.557446  0.858009
E -0.418809  0.349715  1.188413 -1.030944

In [30]:
df.loc['A']

W   -0.385944
X   -0.495023
Y    0.317290
Z    0.141632
Name: A, dtype: float64

In [31]:
df.iloc[0]

W   -0.385944
X   -0.495023
Y    0.317290
Z    0.141632
Name: A, dtype: float64

In [32]:
df.loc[['A', 'B'], ['W', 'Y']]

          W         Y
A -0.385944  0.317290
B -1.516287  0.711454

In [33]:
df > 0

       W      X      Y      Z
A  False  False   True   True
B  False  False   True   True
C   True   True  False  False
D  False  False  False   True
E  False   True   True  False

In [34]:
df[df > 0]

          W         X         Y         Z
A       NaN       NaN  0.317290  0.141632
B       NaN       NaN  0.711454  0.119752
C  0.597146  0.088397       NaN       NaN
D       NaN       NaN       NaN  0.858009
E       NaN  0.349715  1.188413       NaN

In [35]:
df['Y'] > 0

A     True
B     True
C    False
D    False
E     True
Name: Y, dtype: bool

In [36]:
df[df['Y']> 0]

          W         X         Y         Z
A -0.385944 -0.495023  0.317290  0.141632
B -1.516287 -2.292915  0.711454  0.119752
E -0.418809  0.349715  1.188413 -1.030944

In [37]:
(df['Y']> 0 ) & (df['X'] > 0)

A    False
B    False
C    False
D    False
E     True
dtype: bool

In [38]:
df[(df['Y']> 0 ) & (df['X'] > 0)]

          W         X         Y         Z
E -0.418809  0.349715  1.188413 -1.030944

In [40]:
df.index

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [41]:
df.columns

Index(['W', 'X', 'Y', 'Z'], dtype='object')

In [50]:
df.reset_index()
df.reset_index(inplace=True) # A mudança se torna permanente

In [51]:
df

  index         W         X         Y         Z
0     A -0.385944 -0.495023  0.317290  0.141632
1     B -1.516287 -2.292915  0.711454  0.119752
2     C  0.597146  0.088397 -1.622199 -2.385858
3     D -0.143639 -0.810150 -2.557446  0.858009
4     E -0.418809  0.349715  1.188413 -1.030944

In [52]:
df.set_index('index', inplace=True) # restaura o index a partir de uma coluna

In [53]:
df

              W         X         Y         Z
index
A     -0.385944 -0.495023  0.317290  0.141632
B     -1.516287 -2.292915  0.711454  0.119752
C      0.597146  0.088397 -1.622199 -2.385858
D     -0.143639 -0.810150 -2.557446  0.858009
E     -0.418809  0.349715  1.188413 -1.030944

In [54]:
novoInd = 'CA NY WY OR CO'.split()

In [55]:
df['novoInd'] = novoInd

In [56]:
df.reset_index().set_index('novoInd')

        index         W         X         Y         Z
novoInd
CA          A -0.385944 -0.495023  0.317290  0.141632
NY          B -1.516287 -2.292915  0.711454  0.119752
WY          C  0.597146  0.088397 -1.622199 -2.385858
OR          D -0.143639 -0.810150 -2.557446  0.858009
CO          E -0.418809  0.349715  1.188413 -1.030944